{
  "title": "Daily Stock Prices  - 50 Percent",
  "description": "This is a variation of the Daily Stock Prices dataset. In this variation, 50% of the latest epochs from the original timeseries are retained. This dataset provides historical stock data from 52 selected S&P 500 companies over three decades. It aims to capture individual stock trends and patterns while avoiding market-wide influences. The dataset spans 1000 trading days for each stock, with random start dates to ensure decorrelation. Stock tickers have been anonymized to focus on technical analysis. It's ideal for time series forecasting and technical analysis in a real-world stock market context.",
  "modelCategory": "forecasting",
  "schemaVersion": 1.0,
  "inputDataFormat": "CSV",
  "encoding": "utf-8",
  "frequency": "DAILY",
  "forecastLength": 28,
  "idField": {
    "name": "Masked_Ticker",
    "description": "Unique identifier for the stock. This is a masked ticker that replaced the original stock ticker."
  },
  "timeField": {
    "name": "Day_Num",
    "description": "Day number of the observation.",
    "dataType": "INT",
    "example": 501
  },
  "forecastTarget": {
    "name": "Adj Close",
    "description": "Adjusted closing price of the stock; this is the target variable for forecasting.",
    "dataType": "NUMERIC",
    "example": 3.38
  },
  "pastCovariates": [
    {
      "name": "Close",
      "description": "Recorded closing price of the stock on the day.",
      "dataType": "NUMERIC",
      "example": 46.19
    },
    {
      "name": "High",
      "description": "Recorded high (maximum) price of the during the day.",
      "dataType": "NUMERIC",
      "example": 46.26
    },
    {
      "name": "Low",
      "description": "Recorded low (minimum) price of the during the day.",
      "dataType": "NUMERIC",
      "example": 45.18
    },
    {
      "name": "Open",
      "description": "Recorded opening price of the stock on the day.",
      "dataType": "NUMERIC",
      "example": 45.34
    },
    {
      "name": "Volume",
      "description": "Recorded volume of stocks traded during the day.",
      "dataType": "NUMERIC",
      "example": 6163500
    }
  ],
  "futureCovariates": [],
  "staticCovariates": []
}